<?php 
// هذه السطر يبدأ جلسة جديدة أو يستأنف جلسة موجودة. الجلسات تُستخدم لتخزين معلومات المستخدم عبر صفحات متعددة.
session_start();
// هذا السطر يقوم بإزالة جميع المتغيرات المخزنة في الجلسة. بمعنى آخر، كل المعلومات التي كانت محفوظة سابقاً ستُحذف.
session_unset();
// هذا السطر يقوم بإزالة الجلسة بأكملها.مما يعني أن الجلسة لن تكون موجودة بعد الآن.
session_destroy();

// هذا السطر يقوم بإعادة توجيه المستخدم إلى صفحة "index.php". وهذا يعني أنه بعد تنفيذ العمليات السابقة، سيتم نقل المستخدم إلى هذه الصفحة.
header("location:index.php");


?>